Tekla.Structures.Plugins.DrawingPluginBase.UpdateMode
Defines the update mode of the drawing plug-in.
The update mode tells the system when the plug-in is executed.

Tekla.Structures.Plugins.DrawingPluginBase.UpdateMode.CREATE_ONLY
The plug-in is never updated.
Plug-ins are executed from the plug-in dialog instead of the component catalog.
The created objects do not have any relation to the plug-in anymore.
The plug-in dialog cannot be opened from the created objects.

Tekla.Structures.Plugins.DrawingPluginBase.UpdateMode.INPUT_CHANGED
The plug-in is updated when the input is a point and the point is moved or when the input is an object and the object
changes. The plug-in is executed when the input is an object and its properties are changed in the drawing editor.
This mode is the default which is used if the update mode is not defined in the plug-in source.

Tekla.Structures.Plugins.DrawingPluginBase.UpdateMode.DRAWING_OPENED
The plug-in is updated also when a drawing is opened.
The plug-in is executed when the input is changed or during drawing opening.